ndnam198/-STM32F1-UART_RX_DMA/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_usart.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_system.h"
#include "stm32f1xx_ll_exti.h"
#include "stm32f1xx_ll_cortex.h"
#include "stm32f1xx_ll_utils.h"
#include "stm32f1xx_ll_pwr.h"
#include "stm32f1xx.h"
#include "stm32f1xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "string.h"
#include "stdio.h"
#include "myLib.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
#define UART_RX_BUFFER_SIZE			100UL

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BT_UP_Pin GPIO_PIN_6
#define BT_UP_GPIO_Port GPIOA
#define BT_UP_EXTI_IRQn EXTI9_5_IRQn
#define BT_CENTER_Pin GPIO_PIN_7
#define BT_CENTER_GPIO_Port GPIOA
#define BT_CENTER_EXTI_IRQn EXTI9_5_IRQn
#define BT_DOWN_Pin GPIO_PIN_8
#define BT_DOWN_GPIO_Port GPIOA
#define BT_DOWN_EXTI_IRQn EXTI9_5_IRQn
#define USER_LED_3_Pin GPIO_PIN_11
#define USER_LED_3_GPIO_Port GPIOA
#define USER_LED_2_Pin GPIO_PIN_12
#define USER_LED_2_GPIO_Port GPIOA
#define USER_LED_1_Pin GPIO_PIN_5
#define USER_LED_1_GPIO_Port GPIOB
#define USER_LED_4_Pin GPIO_PIN_8
#define USER_LED_4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
#define USER_DEBUG
#define REALITY
#define defineDELAY_LED             200UL
#define defineDELAY_USART_MENU      100UL

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
